---
kind: property
id: P:Autodesk.Revit.DB.Connector.Shape
zh: 连接件、接口
source: html/231e132d-32f4-71b5-a48e-b93874a77904.htm
---
# Autodesk.Revit.DB.Connector.Shape Property

**中文**: 连接件、接口

The shape of the connector.

## Syntax (C#)
```csharp
public virtual ConnectorProfileType Shape { get; }
```